Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: རྣམ་པར་གཟིགས་པ་འཇིག་རྟེན་མགོན། །དེ་ཡི་དྲུང་དུ་བདག་མཆི་སྟེ། །
en: “ ‘I will go to Vipaśyin, The protector of the world,

source: སྲོག་ཆགས་ཀུན་ལ་ཕན་པའི་ཕྱིར། །ཤིན་ཏུ་རྒྱས་པའི་མཆོད་པ་བགྱི། །
en: And then I will make a great offering For the benefit of all who live.

source: ལྷ་རྣམས་དང་ནི་མི་དག་ལས། །གང་དག་བདེ་བ་འདོད་པ་རྣམས། །བདག་ནི་གང་དུ་འགྲོ་བ་ཡི། །རྗེས་བཞིན་དུ་ནི་ཀུན་ཤོག་ཤིག །
en: “ ‘Let those who long for the happy state, Gods and humans alike, Join me on my journey. Come with me!’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་དེས་ཤེས་བཞིན་དུ་ཕྱོགས་བཞིར་བལྟས་ནས རང་གི་ཕ་མ་ལ་ཀྱེ་ཡབ་ཡུམ་བདག་ནི་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་དེ་ག་ལ་བ་དེར་མཆིའོ་ཞེས་དེ་སྐད་སྨྲས་པ་དང་། དེ་ན་སྐྱེ་བོ་མང་པོས་ཐོས་ནས་ དེ་དག་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Then, Śāriputra, the boy looked thoughtfully in the four directions and said to his parents, ‘Father, mother, I am going to see the tathāgata, the arhat, the fully accomplished Buddha Vipaśyin.’

source: ཇི་ལྟར་ན་སྐྱེས་ནས་ཉིན་གཅིག་ཁོ་ན་ལོན་པའི་ཁྱེའུ་ཕ་མ་ལ་སྨྲ་ཞིང་རྐང་པས་འགྲོ་ཞིག་གུ་སྙམ་ནས་ དེ་ན་སྲོག་ཆགས་བྱེ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་འདུས་པར་གྱུར་ཏེ ཁྱེའུ་འདི་ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། དྲི་ཟའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅིའམ། མིའམ། མི་མ་ཡིན་པའམ། གང་ཡིན་ཤེས་པར་བྱའོ་སྙམ་མོ། །
en: “When the crowd heard this they thought, ‘How can it be that this boy can speak to his parents, and that he is able to walk, on the same day he was born?’ The crowd of eighty-four thousand living beings that had gathered thought, ‘What kind of boy is this? A god, a nāga, a yakṣa, a gandharva, an asura, a garuḍa, a kinnara, a human being, or a nonhuman being?’

source: དེ་ནས་ཁྱེའུ་དེ་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ག་ལ་བ་དེར་དོང་ངོ་། ། ཡང་ཤཱ་རིའི་བུ་ཁྱེའུ་དེ་འགྲོ་བ་ན་སྟེང་གི་བར་སྣང་ལས་གདུགས་སྟོང་ཕྲག་བཅུ་བྱུང་ནས་དེ་དག་གིས་དེའི་ལུས་བསྐྱབས་ཏེ། དེའི་ལུས་ལ་རླུང་དང་། ཉི་མས་གནོད་པར་མ་གྱུར་པར་བྱེད་དོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་སྟེང་གི་བར་སྣང་ལས་གསེར་གྱི་དྲ་བ་བྲེས་པར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལྷའི་ལས་ཀྱང་འདས་པའི་མེ་ཏོག་གི་ཆར་དང་ཕྱེ་མའི་ཆར་རབ་ཏུ་འབབ་བོ། །ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་བསིལ་བའི་རླུང་ལྷའི་དྲི་དང་ལྡན་པ་ལངས་སོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལམ་སྤོས་ཆུས་བཏབ་པར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལམ་གསེར་གྱི་གླེགས་མས་གཡོགས་པར་གྱུར་ཏོ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལམ་བུས་ནུབ་ཙམ་དུ་ལྷའི་མེ་ཏོག་ཆལ་པར་བཀྲམ་པར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་རྫིང་བུ་སྟོང་ཕྲག་དུ་མ་བྱུང་སྟེ། རྫིང་བུ་དེ་དག་ཀྱང་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་ལ་མེ་ཏོག་ཨུད་པལ་དང་། པད་མ་དང་། ཀུ་མུད་དང་། པད་མ་དཀར་པོས་ཁེབས་ཤིང་ངུར་པ་སྒྲ་འབྱིན་པར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལམ་གྱི་མུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེགས་བུ་དཀྲིགས་པར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལྷའི་སིལ་སྙན་མང་པོ་འཁྲོལ་བར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་ལམ་གྱི་གཡས་གཡོན་རིན་པོ་ཆེས་ཀུན་ཏུ་བརྒྱན་པར་གྱུར་ཏོ། ། ཡང་ཁྱེའུ་དེ་འགྲོ་བ་ན་མདུན་དུ་མེ་ཏོག་གོ་སྲང་ཞིག་བྱུང་བར་གྱུར་ཏེ། དེ་ལ་རྐང་པ་འདོར་ཞིང་བཏེག་པ་དང་མི་སྣང་བར་གྱུར་ཏོ། ། དེ་ནས་ཁྱེའུ་དེ་ཡུད་ཙམ་ཞིག་ལམ་དུ་འཕགས་ཏེ། །
en: “The boy, together with these eighty-four thousand living beings, then went to the place where the tathāgata, arhat, fully accomplished Buddha Vipaśyin was staying. On the way, the boy manifested ten thousand umbrellas in the sky in order to provide shade for his body, so that he would not be disturbed by the wind or the heat. Wherever the boy went, there would be a golden net suspended above him. Wherever the boy walked, a rain of flowers and perfume, surpassing even those of the divine realms, would fall about him. Wherever the boy walked, a cool breeze filled with divine scents would blow. Wherever the boy walked, perfumed water would be sprinkled on his path. Wherever the boy walked, golden tiles would cover his path. Wherever the boy walked, a knee-high carpet of divine flowers would be spread over his path. Wherever the boy walked, many thousands of ponds would appear, and in these ponds would be water that possesses eight qualities. They would be covered in blue, red, pink, and white lotuses, and the cries of wild geese would resound above. Wherever the boy walked, his path would be a platform covered by the seven precious substances. Wherever the boy walked, many thousands of instruments would be heard. Wherever the boy walked, his path would be ornamented by jewels to the left and right. Wherever the boy stepped, a row of flowers would appear for him to step on, and when he lifted his feet they would not leave any imprint.

source: སླར་བལྟས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Then, after he had walked awhile, the boy looked up and spoke these verses:

source: རིགས་པ་མི་རིགས་ནམ་ཡང་མི་འགྲོགས་ཏེ། །
en: “ ‘The consistent never accompany the inconsistent—

source: ང་ལམ་རྒྱ་ཆེན་ཚུལ་ནི་གུད་ན་ཡོད། །
en: My path is set apart; it is illustrious.

source: ཁྱོད་ནི་མི་རིགས་ང་ནི་རིགས་པ་སྟེ། །
en: You are inconsistent, I am consistent —

source: རིགས་པས་རྒྱལ་བའི་དྲུང་དུ་འགྲོ་བར་བྱ། །
en: I am seeking an audience with the consistent one, the Victorious One.

source: བསྐལ་པ་ཁྲག་ཁྲིག་མང་པོ་འདས་ཀྱང་ནི། །བརྒྱ་ལམ་དག་ན་མི་ཡི་ལུས་ཐོབ་ཅིང་། །བརྒྱ་ལམ་དག་ན་སངས་རྒྱས་འབྱུང་འགྱུར་ཏེ། །དད་དང་ཤེས་རབ་དག་ཀྱང་བརྒྱ་ལམ་ཐོབ། །
en: “ ‘On rare occasions one achieves a human existence, On rare occasions a buddha will appear, And on rare occasions one possesses faith and wisdom, But this only comes to pass once in a great many eons.’

source: ཤཱ་རིའི་བུ་ཁྱེའུ་དེས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་མ་ཐག་ཏུ་དེ་ནས་སྟེང་གི་བར་སྣང་ལས་ལྷ་བྱེ་བ་བརྒྱད་ཁྲི་བཞི་སྟོང་གིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ
en: “Śāriputra, the moment the boy had uttered these verses, eighty-four billion gods appeared in the sky and expressed their approval, saying:

source: ལེགས་སོ་ལེགས་སོ་ཤེས་རབ་ཆེ། །
en: “ ‘Excellent! Excellent! How incredibly wise!

source: ཁྱོད་ཀྱིས་སྨྲས་པ་མཆོག་ཡིན་གྱིས། །མི་རིགས་རྣམས་ནི་ཕྱི་ནས་འོང་། །
en: You speak with distinction And so these inconsistent people follow you.

source: གྲོགས་པོ་རིགས་པ་ཁྱོད་བཞུད་ཅིག །
en: Lead them on as a true friend.’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་དེས་ལྷ་རྣམས་ལ་སླར་ཚིགས་སུ་བཅད་དེ་
en: “Śāriputra, the boy then offered this verse in reply to the gods:

source: སྨྲས་པ། ཁྱེད་ཀྱིས་རིགས་ཞེས་སྨྲས་པ་དང་། །ཁྱེད་ཀྱིས་མི་རིགས་ཞེས་སྨྲས་པ། །རིགས་པའི་དོན་ནི་ཇི་ལྟ་བུ། །མི་རིགས་དོན་ཀྱང་ཇི་ལྟ་བུ།
en: “ ‘You speak of being consistent, And you speak of being inconsistent; But what does consistent mean, And what does inconsistent mean?’

source: ཤཱ་རིའི་བུ་དེ་ནས་ལྷ་དེ་དག་གིས་ཁྱེའུ་དེ་ལ་སླར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then, Śāriputra, the gods replied to the boy with the following verses:

source: འདོད་པའི་ལོངས་སྤྱོད་གང་གནས་པ། །དེ་དག་མངོན་འབྱུང་སྤྱོད་ཡུལ་མིན། །
en: “ ‘For those who are stuck in the pleasures of the senses, There is no room for renunciation.

source: དེ་དག་མི་རིགས་རྨོངས་པ་སྟེ། །
en: They are inconsistent and confused.

source: དེ་དག་སེམས་ཅན་དམྱལ་གནས། །
en: They are on the path to hell.

source: འདོད་པའི་ལོངས་སྤྱོད་སྤངས་བྱས་ནས། །
en: “ ‘Those who discard the pleasures of the senses

source: ཁྱིམ་མེད་པར་ནི་རབ་ཏུ་འབྱུང་། །
en: And live the renunciant homeless life

source: འཇིག་རྟེན་འདི་ན་དེ་དག་རིགས། །
en: Are the consistent ones in this world.

source: དེ་དག་རིགས་ཞེས་རབ་ཏུ་བཤད། །
en: It is they who can be said to be consistent.’

source: ཤ་རིའི་བུ་དེ་ནས་ཁྱེའུ་དེས་ལྷ་དེ་དག་ལ་སླར་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Śāriputra, the boy then replied to the gods with this verse:

source: ཇི་ལྟར་རིགས་ཞེས་བྱ་བ་དེ། །
en: “ ‘You do not have any understanding

source: ཁྱེད་ཀྱིས་དེ་ནི་མི་ཤེས་སོ། །
en: Of what the word consistent implies.

source: ཇི་ལྟར་མི་རིགས་ཞེས་བྱ་བ། །ངས་ནི་དེ་དག་རབ་ཏུ་ཤེས། །
en: I, however, understand Exactly what is meant by the word inconsistent.’

source: དེ་ལྟར་ཤཱ་རིའི་བུ་ཁྱེའུ་དེ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ག་ལ་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: “So, Śāriputra, the boy went on his way to where the lord, the Tathāgata Vipaśyin, was staying. When he arrived there he honored him by placing his head at the Lord’s feet, circumambulating him three times, and then sitting to one side. He then sang the praises of the lord, the tathāgata Vipaśyin, with the following verses:

source: འཇིག་རྟེན་དག་གི་དོན་ཕྱིར་སྤྱོད། །རིགས་གསུམ་བདུད་རྩི་རབ་སྦྱིན་པ། །གླང་པོ་ཆེན་པོ་སེང་གེ་ཆེ། །རྟག་ཏུ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “ ‘Acting for the benefit of the world, Bestowing the nectar of the threefold knowledge, As great as an elephant, as great as a lion—May you always be worshiped.

source: འཇིག་རྟེན་སྣང་མཛད་ཤིན་ཏུ་དཀོན། །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ། །ཨུ་དུམ་བ་རའི་མེ་ཏོག་བཞིན། །ཁ་དོག་ལྡན་ཞིང་དབྱིབས་མཛེས་པ། །འཇིག་རྟེན་འདི་ནི་ཉེ་བར་གཙེས། །
en: “ ‘A light for the world such as him is hard to come by— A protector of the world, providing illumination, Just like an udumbara flower In his appearance and his excellent features. “ ‘They put the world at risk

source: འཕགས་པའི་ལམ་ལ་མི་མཁས་ཏེ། །
en: Because they do not understand the noble path.

source: ས་ཡི་སྟེང་ན་དམུས་ལོང་བཞིན། །ལམ་ངན་པར་ནི་རབ་ཏུ་རྒྱུག །
en: Straying onto the wrong path, They are like blind people scrambling on the ground.

source: མི་མཆོག་ཁྱོད་ནི་ཅི་འདྲ་བར། །བདག་ནི་འཇིག་རྟེན་སངས་རྒྱས་གྱུར། །
en: “ ‘May I become an awakened one in this world, Just like you, supreme one among men.

source: མེ་གསུམ་དག་གིས་ཚིག་པ་ཡི། །སྡུག་བསྔལ་བ་ལས་སེམས་ཅན་དགྲོལ། །
en: I will free sentient beings from suffering, From the burning agony of the three fires.

source: སྲོག་ཆགས་བརྒྱ་པོ་འདི་ཀུན་ཀྱང་། །བདག་གི་སླད་དུ་མཆིས་པ་ལགས། འདི་དག་ལ་ནི་ཆོས་བསྟན་ཅིང་། །བྱང་ཆུབ་མཆོག་ལ་དགོད་དུ་གསོལ། །
en: “ ‘All these hundreds of living beings Have come here with me. Please illuminate the Dharma for them And spur them on toward supreme awakening.’

source: དེ་ནས་ཤཱ་རིའི་བུ་ཁྱེའུ་དེས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ནས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཆོས་སྟོན་པ་དེ་ལ་དེ་སྐད་ཅེས་གསོལ་པ་དང་། སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གིས་ཀྱང་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་གྱུར་ཅིང་འདི་ལྟ་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ཆོས་སྟོན་པ་བཞིན་དུ་ཆོས་སྟོན་པར་གྱུར་ཅིག ། དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཀྱིས་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་དེ་དག་གི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །
en: “When he had spoken these verses, Śāriputra, the boy implored the Lord, the tathāgata, arhat, fully accomplished Buddha Vipaśyin, to teach the Dharma. The eighty-four thousand beings who had accompanied him addressed the Lord, the tathāgata, arhat, fully accomplished Buddha Vipaśyin, too, saying, ‘Lord, we, too, want to become tathāgatas in the future, arhats and fully accomplished buddhas who can teach the Dharma. We therefore hope that the Lord, the Tathāgata Vipaśyin, will teach us the Dharma.’ Then, when the Lord, the tathāgata, arhat, fully accomplished Buddha Vipaśyin, saw the sincerity of these eighty-four thousand beings, he smiled.

source: འདི་ནི་ཆོས་ཉིད་དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་ན་འཛུམ་པ་མཛད་པ་དེ་ན་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་ཁ་དོག་དུ་མ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་འོད་ཟེར་འདི་ལྟ་སྟེ། སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་དང་། ཤེལ་དང་། དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་བྱུང་སྟེ། དེ་དག་གིས་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བས་ཁྱབ་པར་བྱས་ནས་ཚངས་པའི་འཇིག་རྟེན་གྱི་བར་དུ་མངོན་པར་སོང་སྟེ། ཉི་མ་དང་། ཟླ་བའི་གཟི་བརྗིད་སྤ་བཀོང་ནས་སླར་ལོག་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ལ་ལན་བརྒྱ་སྟོང་ཕྲག་དུ་མར་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་དེའི་གཙུག་ཏུ་མི་སྣང་བར་གྱུར་ཏོ། །
en: “As is in the nature of the buddhas, the lords, when they smile, many-colored variegated light issued from his mouth. This light was blue, yellow, red, white, crimson, crystal, and silver, and it spread throughout the world, all the way up to the realm of the brahmā gods, outshining the light of the moon and sun. When it returned, it circled the Lord, the tathāgata, arhat, fully accomplished Buddha Vipaśyin, many hundreds of thousands of times, and it then dissolved into the crown of the Lord’s head.

source: ཤཱ་རིའི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་དེའི་ཞབས་འབྲིང་བ་དགེ་སློང་དེས། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་འཛུམ་པ་མཛད་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ། ཆོས་གོས་ཕྲག་པ་གཅིག་ལ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསོལ་ཏོ། །
en: “Then, Śāriputra, the mendicant who was the attendant of the Lord, the Tathāgata Vipaśyin, saw that the Lord, the Tathāgata Vipaśyin, was smiling, and so he got up from his seat, placed his robe over his shoulder, knelt down on his right knee, and addressed the Lord, the Tathāgata Vipaśyin, with the following verses:

source: བཅོམ་ལྡན་ཅིའི་རྒྱུ་བདེ་གཤེགས་ཅི་རྐྱེན་གྱིས། །གང་ཕྱིར་འཇིག་རྟེན་མགོན་པོ་འཛུམ་མཛད་དེ། །རབ་ཏུ་མཛེས་ཤིང་ཤིན་ཏུ་དཀོན་འབྱུང་བ། །རྣམ་གཟིགས་སངས་རྒྱས་མཆོག་ལ་བདག་ཞུའོ། །
en: “ ‘If I may ask the Arhat, the supreme Buddha Vipaśyin, The graceful one, so difficult to encounter, What is the reason, O Protector of the World, for your smile? What is the cause, lord Sugata, of your smile?

source: རྒྱུ་མ་མཆིས་ཤིང་རྐྱེན་མ་མཆིས་པར་ནི། །རྐང་གཉིས་གཙོ་བོ་འཛུམ་པ་མི་མཛད་ན། །འཇིག་རྟེན་ཕན་པ་ཐུགས་བརྩེ་འཛུམ་མཛད་པ། །འདི་ཡི་རྒྱུ་རྐྱེན་གང་ལགས་བདག་ལ་གསུངས། །
en: “ ‘The one who is supreme among those who walk on two feet Does not smile without a cause, without a reason. Please tell me the reason why You smiled so lovingly, to help the world.

source: ཐུབ་ཆེན་གྱི་ནི་སྤྱན་སྔར་མཆིས་པ་ཡི། །སྲོག་ཆགས་བརྒྱ་སྟོང་མཆིས་པ་འདི་དག་ཀྱང་། །རྣ་བ་བླགས་ཏེ་མཆིས་ཤིང་ཉན་འཚལ་ན། །དེ་དག་ཐུགས་བརྩེའི་སླད་དུ་མགོན་པོས་གསུངས། །
en: “ ‘There are hundreds of thousands of beings Present here in front of you, Great Sage. They are eager to hear, they wish to listen. Please speak, O Protector, out of empathy for them.

source: ཁྱོད་ནི་སྲོག་ཆགས་ཀུན་གྱི་མིག་ལགས་ཏེ། །
en: “ ‘The eyes of all beings are upon you.

source: ཁྱོད་ནི་གནས་སྐྱབས་མགོན་དང་དཔུང་གཉེན་ལགས། །ཁྱོད་ནི་སྲོག་ཆགས་ཀུན་གྱི་ཐེ་ཚོམ་གཅོད། །འཇིག་རྟེན་ཕན་པར་མཛད་ཅིང་ཐུགས་བརྩེ་བ། །ཁྱོད་ཀྱིས་འདས་ལ་རྟག་ཏུ་ཡེ་ཤེས་འཇུག །
en: You are the refuge and ultimate sanctuary for those who need protection, You sever the doubts of all beings. You are a loving benefactor to the world. “ ‘Your profound knowledge of the past is ever present.

source: ཁྱོད་ཀྱིས་མ་འོངས་ཐམས་ཅད་རབ་ཏུ་མཁྱེན། །
en: You have full knowledge of everything that is yet to come.

source: སངས་རྒྱས་ཞིང་ན་ཅུང་ཟད་ཅི་མཆིས་པ། །བྱུང་བ་དག་ལའང་ཐེ་ཚོམ་མི་མངའོ། །
en: You have no doubts about what is happening, Even about the smallest thing that occurs within this buddha field.

source: དེ་བཞིན་གཤེགས་པ་དུས་གསུམ་ཡེ་ཤེས་ལྡན། །
en: “ ‘The Tathāgata possesses knowledge of the three times.

source: ཆོས་ཀྱི་རྗེ་ནི་ཐམས་ཅད་འཛིན་པའི་གསུང་། །
en: The speech of the Lord of the Dharma encompasses everything.

source: འཇིག་རྟེན་མགོན་པོ་འཛུམ་པ་མཛད་པ་འདི། །རྒྱུ་རྐྱེན་གང་ལགས་བདག་ནི་ཁྱོད་ལ་ཞུ། །
en: Protector of the world, permit me to ask you, What is the cause of your smile? What is the reason for it?

source: ཁྱོད་ཀྱིས་འདིར་ནི་ཐེ་ཚོམ་ཐམས་ཅད་ཆོད། །
en: “ ‘In this place you sever all doubts.

source: ཁྱོད་ནི་ཆོས་ཀུན་ལ་ཡང་ཐེ་ཚོམ་མེད། །
en: You do not hesitate in any way when it comes to the Dharma.

source: ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསུང་འབྱིན་ཅིང་། །སྲོག་ཆགས་མྱ་ངན་ཟུག་རྔུ་བསལ་དུ་གསོལ། །
en: You eliminate the stings of pain for beings As your voice bestows that which is eightfold.

source: རབ་ཏུ་མགུ་ཞིང་དགའ་བའི་སེམས་རྒྱས་ནས། །
en: “ ‘In a state of joy, my mind elated,

source: སོར་མོ་བཅུ་རྣམས་ཐལ་མོ་རབ་སྦྱར་ཏེ། ། འཛུམ་པ་མཛད་འདི་རྒྱུ་རྐྱེན་གང་ལགས་པ། །ཆོས་རྗེ་ཁྱོད་ལ་བདག་ནི་དེ་ཞུའོ། །
en: I ask you now, lord of the Dharma, As I bring my ten fingers together in a gesture of reverence, What is the cause of your smile? What is the reason for it?’

source: ཤཱ་རིའི་བུ་དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་དེས་ཞབས་འབྲིང་བ་དགེ་སློང་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། ། དགེ་སློང་ཁྱོད་ཀྱིས་ཁྱེའུ་འདི་མཐོང་ངམ།
en: “Śāriputra, the Lord, the tathāgata, arhat, fully accomplished Buddha Vipaśyin, then said this to his attendant mendicant, ‘Mendicant, do you see this boy?’

source: གསོལ་པ། བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །བདེ་བར་གཤེགས་པ་མཐོང་ངོ་། །
en: “ ‘I see him, Lord. I see him, Sugata,’ he replied.

source: བཀའ་སྩལ་པ། དགེ་སློང་ཁྱེའུ་འདིས་རྫོགས་པའི་བྱང་ཆུབ་བཙལ་བའི་ཕྱིར་སྔོན་འདས་པའི་དུས་ན་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བཞི་ལ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་སྟན་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་ཀྱིས་སྟི་སྟང་བྱས། བླ་མར་བྱས། རིམ་གྲོར་བྱས། མཆོད་པར་བྱས་སོ། ། དེ་ནས་ཁྱེའུ་འདིས་རྫོགས་པའི་བྱང་ཆུབ་བཙལ་བའི་ཕྱིར་སངས་རྒྱས་ཁྲག་ཁྲིག་ཕྲག་བཅུ་ལ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །
en: “ ‘In the past, mendicant, this boy, seeking complete awakening, has honored, venerated, shown respect to, and made offerings of cloth, alms, bedding, healing medicine, and utensils to sixty-four thousand million billion trillion buddhas. Seeking complete awakening, this boy has lived the life of purity together with a trillion buddhas.

source: དགེ་སློང་ཁྱོད་ཀྱིས་སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་འདི་དག་མཐོང་ངམ།
en: “ ‘Mendicant, do you see these eighty-four thousand beings?’

source: བཀའ་སྩལ་པ། སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་པོ་འདི་དག་ནི་སྔོན་ཁྱེའུ་འདིའི་ཕ་མར་གྱུར་ཏོ། ། དགེ་སློང་ཁྱེའུ་འདིས་འདི་ལྟ་བུའི་སྨོན་ལམ་བཏབ་པར་གྱུར་ཏེ། དེ་གང་དང་གང་དུ་སྐྱེས་པ་ན། གང་བདག་གི་ཕ་མར་གྱུར་པ་དེ་དག་བདག་གིས་བྱང་ཆུབ་ལ་དགོད་དོ། ། ཡང་གཉིས་སུ་ན་དེ་དག་བུད་མེད་ཀྱི་དངོས་པོར་མངོན་པར་མ་གྲུབ་ཅིག་ཅེས་བྱས་པས་དེ་དག་ད་ལྟར་ཁྱེའུ་དེའི་རྗེས་སུ་སློབ་པའི་ཚུལ་གྱིས་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: “ ‘In the past, these eighty-four thousand beings were this boy’s parents, and, mendicant, this boy made this prayer: “May I establish those who become my parents, in any of the births I may take, in awakening. Likewise, may they not be born as female.” This was what motivated the boy to cultivate the mind of unsurpassed perfect awakening.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ཀྱིས་ཞབས་འབྲིང་བ་དགེ་སློང་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: “The lord, the Tathāgata Vipaśyin, spoke these verses to his attendant:

source: དགེ་སློང་ཁྱོད་ཀྱི་མདུན་ན་ཁྱེའུ་འདི་དང་། །སྲོག་ཆགས་སྟོང་གནས་མཆོག་ཏུ་དགའ་སེམས་ཀྱིས། །ཇི་ལྟར་ཆོས་ཀྱི་བདག་པོ་འདི་བཞིན་དུ། །གྱུར་ཅིག་ཅེས་སྨྲ་ཁྱོད་ཀྱིས་མཐོང་བ་སྟེ། །
en: “ ‘Mendicant, do you see this boy in front of us And his following of thousands of beings, As he says with a joyful, elated mind, “I will become a lord of the Dharma”?

source: དགེ་སློང་འདིས་ནི་སྔོན་གྱི་ཚེ་རབས་ལ། །ལྷར་བཅས་འཇིག་རྟེན་དག་ལ་ཕན་པའི་ཕྱིར། །འཇིག་རྟེན་རྣམ་འདྲེན་བྱེ་བ་ཁྲག་ཁྲིག་ཀྱང་། །སྟོང་ཕྲག་དྲུག་ཅུ་བཞི་ལ་རི་མོར་བྱས། །
en: “ ‘Mendicant, in previous lives He performed sixty-four thousand million billion Acts of reverence to the guides of the world, For the benefit of the world with its gods.

source: བྱང་ཆུབ་མཆོག་འདི་ལ་ནི་རེ་བའི་ཕྱིར། །དེ་ནི་སངས་རྒྱས་ཁྲག་ཁྲིག་ཕྲག་བཅུ་ཡིས། །བསྟན་པ་ལ་ནི་ཆེད་དུ་རབ་བྱུང་ནས། །དེ་ན་ཚངས་པར་སྤྱོད་པ་མཆོག་སྤྱད་དོ། །
en: “ ‘In the presence of ten billion buddhas, He became a renunciant, entered the discipline, And led the unsurpassed life of purity With the aspiration to attain supreme awakening.

source: ཁྱོད་ཀྱིས་སྲོག་ཆགས་སྟོང་ཕྲག་བརྒྱད་ཅུ་བཞི། །ང་མདུན་འདུག་པ་དེ་དག་ཀུན་མཐོང་ངམ། །དེ་དག་སྔོན་ཆད་འདས་དུས་ཡངས་པ་ན། དེ་ཡི་མར་ནི་གྱུར་པ་ཤ་སྟག་གོ །
en: “ ‘Do you see these eighty-four hundreds of thousands Of beings who are standing in front of me? They have all been his mothers Throughout the vast reaches of the past.

source: གང་དང་གར་སྐྱེས་ང་ཡི་མར་གྱུར་པ། །ཐམས་ཅད་བདག་གིས་བྱང་ཆུབ་མཆོག་ལ་བཀོད། །ཅི་ནས་བུད་མེད་དངོས་པོར་མ་གྱུར་ཞེས། །དེས་ནི་སྨོན་ལམ་འདི་འདྲ་བཏབ་པར་གྱུར། །
en: “ ‘He made this solemn aspiration: “May I establish all those who will be my mothers In lives to come, in supreme awakening, And may they never again be female.”

source: དེ་དག་ཐམས་ཅད་དེ་ཡི་རྗེས་སློབ་ཅིང་། །བྱང་ཆུབ་ཀྱི་ནི་སེམས་ལ་གཞོལ་བར་གྱུར། །
en: “ ‘With all these goals in mind, He turned toward the mind of awakening.

source: འདི་དག་རྐང་གཉིས་ཀྱི་ནི་མཆོག་འགྱུར་ཞེས། །དེ་དག་ལ་ནི་ངས་ལུང་བསྟན་པར་བྱ། །
en: I make this prophesy to you, That they will become unsurpassed among those who walk on two feet.

source: མ་འོངས་དུས་ན་ཇི་ལྟར་སྤྱོད་འགྱུར་ཞིང་། །མི་མཆོག་ཏུ་ནི་ཇི་ལྟར་འགྱུར་བ་དང་། །དེ་དག་སྔོན་གྱི་སྤྱོད་པ་རབ་ཤེས་ཏེ། ། དེ་ཡི་ཕྱིར་ནི་འཛུམ་པ་ངས་མཛད་དོ། །
en: “ ‘This is the reason why I smile. I know what has happened in the past And what things will be like in the future. I know that they will become supreme among men.’

source: དེ་སྐད་ལུང་བསྟན་པ་ནི་ཐོས་གྱུར་ནས། །རྣམ་པར་གཟིགས་པ་འཇིག་རྟེན་སྤྱོད་པ་ལ། །ལྷ་དང་ཀླུ་དང་དེ་བཞིན་མི་རྣམས་དང་། །སྲོག་ཆགས་བྱེ་བ་རྣམས་ནི་དགའ་བར་འགྱུར། །
en: “When they heard this prophesy That Vipaśyin made openly, Billions of beings were overjoyed, Gods and nāgas as well as men.

source: ཤ་རིའི་བུ་དེ་ནས་ཁྱེའུ་དེ་དགའ་མགུ་རངས་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་། ཡིད་བདེ་བ་སྐྱེས་ནས་རིངས་པའི་ཚུལ་གྱིས་རང་གི་ཕ་མ་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རང་གི་ཕ་མ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “At this, Śāriputra, the boy was delighted and thrilled. His mind was transported with joy, and in this joyous and happy state he eagerly returned to his parents. When he arrived, he spoke this verse to them:

source: སྲོག་ཆགས་བརྒྱ་པོ་དེ་དག་ཀུན། །སྔོན་ནི་བདག་གི་མར་གྱུར་ཏེ། །
en: “ ‘All these hundreds of beings Who have been my mothers in the past

source: ཐམས་ཅད་བྱང་ཆུབ་རབ་ཞུགས་ན། །
en: Will be led to the state of awakening.

source: ཁྱེད་ཀྱི་སེམས་ནི་གང་དུ་འཇུག །
en: What do you think of this?’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་དེའི་ཕ་མས་ཁྱེའུ་དེ་ལ་སླར་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Śāriputra, the boy’s parents then spoke these verses to him:

source: ཁྱོད་ཀྱིས་དེ་དག་ཇི་ལྟ་བ། །དེ་ལྟར་ང་ཡི་སེམས་འཇུག་སྟེ། །
en: “ ‘I see things in the Same way as you do.

source: ང་ནི་ཐམས་ཅད་མཁྱེན་པར་འགྱུར། །
en: I will become an omniscient one—

source: འདི་ལ་ང་ནི་ཐེ་ཚོམ་མེད། །
en: There is no doubt in my mind about this.

source: གང་དུ་སྐྱེས་པར་ང་མ་འབྲལ། །ཁྱོད་ལ་གནས་ནི་འདི་སློང་གིས། །ཇི་ལྟར་བྱང་ཆུབ་ང་ཐོབ་པར། །རྟག་ཏུ་ང་ནི་དྲན་པར་གྱིས། །
en: “ ‘I make this request of you: That wherever you are born you will suckle at my breast. Then I will always bear in mind That I am to reach awakening.’

source: ཤཱ་རིའི་བུ་དེ་ནས་ཁྱེའུ་དེས་རང་གི་མ་སྐྱེད་པར་བྱེད་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: “Then, Śāriputra, the boy replied to his mother, who had given birth to him, with this verse:

source: ཇི་ལྟར་བདག་གིས་བསྐུལ་བ་རྣམས། །དེ་དག་ཐོག་མར་སངས་རྒྱས་འགྱུར། །
en: “ ‘First they will become buddhas, Just as I have indicated.

source: བདག་ནི་སྐྱེས་བུ་ཁ་ལོ་སྒྱུར། ། འཇིག་རྟེན་སྒྲོན་མར་ཕྱིས་འགྱུར་བགྱི། །
en: Then I will become a light for the world, A charioteer of men.’
